#include <stdio.h>

int main() {

	char str1 = 0xFC;
	char str2 = 0x37;
	char str3 = 0;


	//位运算： & （AND） 并且，两个相等才等于1
	//1111 1100
	//0011 0111
	str3 = str1 & str2;
	//BIN：0011 0100
	//HEX: 0x34
	// 16 ^ 0 = 1 * 4 = 4;
	// 16 ^ 1 = 16 * 3 = 48;
	// DEC：52	


	//位运算： | （OR） 或者，只要有一个1就为1
	//1111 1100
	//0011 0111
	str3 = str1 | str2;
	//BIN：1111 1111
	//HEX：0xFF
	// 16 ^ 0 = 1 * 15 = 16 ;
	// 16 ^ 1 = 16 * 15 = 240;
	// DEC：255


	//位运算： ~ (NOT) 取反，每个二进制位 0变1  1变0
	//0011 0111
	str3 = ~str2;
	//BIN：1100 1000
	//HEX：0xC8
	//16 ^ 0 = 1 * 8 = 8;
	//16 ^ 1 = 16 * 12 = 192;
	//DEC：200



	//位运算： ^ (XOR) 异或，不一样则为1 否则为0
	str3 = str1 ^ str2;
	//1111 1100
	//0011 0111
	//BIN：1100 1011
	//HEX：0xCB
	//16 ^ 0 = 1 * 11 = 11;
	//16 ^ 1 = 16 * 12 = 192'
	//DEC：203


	//作业二：数据宽度为1Byte 值为 0xC7 在不破坏原始数据的情况下 可以指定获取某个位的值  不允许使用 << >> 操作符 课后作业

	//作业三：创建秘钥加密数据 再用秘钥进行解密

	char key = 0xAB;

	char password = 0x89;

	char jmPassWord = key ^ password;

	//0xAB; 0x89;
	//1010 1011; 
	//1000 1001;
	//0010 0010; -> 0x22;
	//jmPassWord // 值为 0x22 


	//如果需要解密则

	char jieMPassWord = key ^ jmPassWord; // 输出0x89 刚好 == passWord的值






	return 0;
}